#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.gateway-pg-cluster.digitalocean_database_db.app_db: Refreshing state... [id=66dca6ef-7112-4ce8-a985-bbae97eec50f/database/gateway_db]
module.gateway-pg-cluster.digitalocean_database_cluster.mesazon_dev_pg_cluster: Refreshing state... [id=66dca6ef-7112-4ce8-a985-bbae97eec50f]
module.gateway-pg-cluster.digitalocean_database_connection_pool.pg_pool: Refreshing state... [id=66dca6ef-7112-4ce8-a985-bbae97eec50f/gateway-dev-pool-01]
module.gateway-pg-cluster.digitalocean_database_postgresql_config.pg_config: Refreshing state... [id=66dca6ef-7112-4ce8-a985-bbae97eec50f/postgresql-config]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.gateway-pg-cluster.digitalocean_database_cluster.mesazon_dev_pg_cluster will be destroyed
  # (because digitalocean_database_cluster.mesazon_dev_pg_cluster is not in configuration)
  - resource "digitalocean_database_cluster" "mesazon_dev_pg_cluster" {
      - database             = "defaultdb" -> null
      - engine               = "pg" -> null
      - host                 = "gateway-dev-do-user-26186808-0.k.db.ondigitalocean.com" -> null
      - id                   = "66dca6ef-7112-4ce8-a985-bbae97eec50f" -> null
      - metrics_endpoints    = [
          - "https://gateway-dev-do-user-26186808-0.k.db.ondigitalocean.com:9273/metrics",
        ] -> null
      - name                 = "gateway-dev" -> null
      - node_count           = 1 -> null
      - password             = (sensitive value) -> null
      - port                 = 25060 -> null
      - private_host         = "private-gateway-dev-do-user-26186808-0.k.db.ondigitalocean.com" -> null
      - private_network_uuid = "5c94b776-ab7e-43c0-900e-cbbfb3979725" -> null
      - private_uri          = (sensitive value) -> null
      - project_id           = "8a8c246e-2057-46b7-a01a-04cbbbf0b8d9" -> null
      - region               = "fra1" -> null
      - size                 = "db-s-1vcpu-1gb" -> null
      - storage_size_mib     = "10240" -> null
      - tags                 = [
          - "dev",
        ] -> null
      - uri                  = (sensitive value) -> null
      - urn                  = "do:dbaas:66dca6ef-7112-4ce8-a985-bbae97eec50f" -> null
      - user                 = "doadmin" -> null
      - version              = "18" -> null
    }

  # module.gateway-pg-cluster.digitalocean_database_connection_pool.pg_pool will be destroyed
  # (because digitalocean_database_connection_pool.pg_pool is not in configuration)
  - resource "digitalocean_database_connection_pool" "pg_pool" {
      - cluster_id   = "66dca6ef-7112-4ce8-a985-bbae97eec50f" -> null
      - db_name      = "gateway_db" -> null
      - host         = "gateway-dev-do-user-26186808-0.k.db.ondigitalocean.com" -> null
      - id           = "66dca6ef-7112-4ce8-a985-bbae97eec50f/gateway-dev-pool-01" -> null
      - mode         = "transaction" -> null
      - name         = "gateway-dev-pool-01" -> null
      - password     = (sensitive value) -> null
      - port         = 25061 -> null
      - private_host = "private-gateway-dev-do-user-26186808-0.k.db.ondigitalocean.com" -> null
      - private_uri  = (sensitive value) -> null
      - size         = 10 -> null
      - uri          = (sensitive value) -> null
      - user         = "doadmin" -> null
    }

  # module.gateway-pg-cluster.digitalocean_database_db.app_db will be destroyed
  # (because digitalocean_database_db.app_db is not in configuration)
  - resource "digitalocean_database_db" "app_db" {
      - cluster_id = "66dca6ef-7112-4ce8-a985-bbae97eec50f" -> null
      - id         = "66dca6ef-7112-4ce8-a985-bbae97eec50f/database/gateway_db" -> null
      - name       = "gateway_db" -> null
    }

  # module.gateway-pg-cluster.digitalocean_database_postgresql_config.pg_config will be destroyed
  # (because digitalocean_database_postgresql_config.pg_config is not in configuration)
  - resource "digitalocean_database_postgresql_config" "pg_config" {
      - autovacuum_analyze_scale_factor     = 0.20000000298023224 -> null
      - autovacuum_analyze_threshold        = 50 -> null
      - autovacuum_freeze_max_age           = 0 -> null
      - autovacuum_max_workers              = 0 -> null
      - autovacuum_naptime                  = 60 -> null
      - autovacuum_vacuum_cost_delay        = 20 -> null
      - autovacuum_vacuum_cost_limit        = -1 -> null
      - autovacuum_vacuum_scale_factor      = 0.20000000298023224 -> null
      - autovacuum_vacuum_threshold         = 50 -> null
      - backup_hour                         = 9 -> null
      - backup_minute                       = 13 -> null
      - bgwriter_delay                      = 0 -> null
      - bgwriter_flush_after                = 512 -> null
      - bgwriter_lru_maxpages               = 100 -> null
      - bgwriter_lru_multiplier             = 2 -> null
      - cluster_id                          = "66dca6ef-7112-4ce8-a985-bbae97eec50f" -> null
      - deadlock_timeout                    = 0 -> null
      - id                                  = "66dca6ef-7112-4ce8-a985-bbae97eec50f/postgresql-config" -> null
      - idle_in_transaction_session_timeout = 60000 -> null
      - jit                                 = true -> null
      - log_autovacuum_min_duration         = -1 -> null
      - log_min_duration_statement          = 1000 -> null
      - max_files_per_process               = 0 -> null
      - max_locks_per_transaction           = 0 -> null
      - max_logical_replication_workers     = 0 -> null
      - max_parallel_workers                = 8 -> null
      - max_parallel_workers_per_gather     = 2 -> null
      - max_pred_locks_per_transaction      = 0 -> null
      - max_prepared_transactions           = 0 -> null
      - max_replication_slots               = 0 -> null
      - max_stack_depth                     = 0 -> null
      - max_standby_archive_delay           = 0 -> null
      - max_standby_streaming_delay         = 0 -> null
      - max_wal_senders                     = 0 -> null
      - max_worker_processes                = 0 -> null
      - pg_partman_bgw_interval             = 0 -> null
      - shared_buffers_percentage           = 0 -> null
      - temp_file_limit                     = -1 -> null
      - timezone                            = "UTC" -> null
      - track_activity_query_size           = 0 -> null
      - wal_sender_timeout                  = 60000 -> null
      - wal_writer_delay                    = 0 -> null
      - work_mem                            = 0 -> null
        # (8 unchanged attributes hidden)
    }

  # module.gateway_pg_cluster.digitalocean_database_cluster.pg_cluster will be created
  + resource "digitalocean_database_cluster" "pg_cluster" {
      + database             = (known after apply)
      + engine               = "pg"
      + host                 = (known after apply)
      + id                   = (known after apply)
      + metrics_endpoints    = (known after apply)
      + name                 = "gateway-dev"
      + node_count           = 1
      + password             = (sensitive value)
      + port                 = (known after apply)
      + private_host         = (known after apply)
      + private_network_uuid = (known after apply)
      + private_uri          = (sensitive value)
      + project_id           = "8a8c246e-2057-46b7-a01a-04cbbbf0b8d9"
      + region               = "fra1"
      + size                 = "db-s-1vcpu-1gb"
      + storage_size_mib     = (known after apply)
      + tags                 = [
          + "mesazon-dev",
        ]
      + ui_database          = (known after apply)
      + ui_host              = (known after apply)
      + ui_password          = (sensitive value)
      + ui_port              = (known after apply)
      + ui_uri               = (sensitive value)
      + ui_user              = (known after apply)
      + uri                  = (sensitive value)
      + urn                  = (known after apply)
      + user                 = (known after apply)
      + version              = "18"
    }

  # module.gateway_pg_cluster.digitalocean_database_connection_pool.pg_pool will be created
  + resource "digitalocean_database_connection_pool" "pg_pool" {
      + cluster_id   = (known after apply)
      + db_name      = "gateway_db"
      + host         = (known after apply)
      + id           = (known after apply)
      + mode         = "transaction"
      + name         = "gateway-dev-pool-01"
      + password     = (sensitive value)
      + port         = (known after apply)
      + private_host = (known after apply)
      + private_uri  = (sensitive value)
      + size         = 10
      + uri          = (sensitive value)
      + user         = "doadmin"
    }

  # module.gateway_pg_cluster.digitalocean_database_db.pg_db will be created
  + resource "digitalocean_database_db" "pg_db" {
      + cluster_id = (known after apply)
      + id         = (known after apply)
      + name       = "gateway_db"
    }

  # module.gateway_pg_cluster.digitalocean_database_postgresql_config.pg_config will be created
  + resource "digitalocean_database_postgresql_config" "pg_config" {
      + autovacuum_analyze_scale_factor     = (known after apply)
      + autovacuum_analyze_threshold        = (known after apply)
      + autovacuum_freeze_max_age           = (known after apply)
      + autovacuum_max_workers              = (known after apply)
      + autovacuum_naptime                  = (known after apply)
      + autovacuum_vacuum_cost_delay        = (known after apply)
      + autovacuum_vacuum_cost_limit        = (known after apply)
      + autovacuum_vacuum_scale_factor      = (known after apply)
      + autovacuum_vacuum_threshold         = (known after apply)
      + backup_hour                         = (known after apply)
      + backup_minute                       = (known after apply)
      + bgwriter_delay                      = (known after apply)
      + bgwriter_flush_after                = (known after apply)
      + bgwriter_lru_maxpages               = (known after apply)
      + bgwriter_lru_multiplier             = (known after apply)
      + cluster_id                          = (known after apply)
      + deadlock_timeout                    = (known after apply)
      + default_toast_compression           = (known after apply)
      + id                                  = (known after apply)
      + idle_in_transaction_session_timeout = 60000
      + jit                                 = (known after apply)
      + log_autovacuum_min_duration         = (known after apply)
      + log_error_verbosity                 = (known after apply)
      + log_line_prefix                     = (known after apply)
      + log_min_duration_statement          = 1000
      + max_files_per_process               = (known after apply)
      + max_locks_per_transaction           = (known after apply)
      + max_logical_replication_workers     = (known after apply)
      + max_parallel_workers                = (known after apply)
      + max_parallel_workers_per_gather     = (known after apply)
      + max_pred_locks_per_transaction      = (known after apply)
      + max_prepared_transactions           = (known after apply)
      + max_replication_slots               = (known after apply)
      + max_stack_depth                     = (known after apply)
      + max_standby_archive_delay           = (known after apply)
      + max_standby_streaming_delay         = (known after apply)
      + max_wal_senders                     = (known after apply)
      + max_worker_processes                = (known after apply)
      + pg_partman_bgw_interval             = (known after apply)
      + pg_partman_bgw_role                 = (known after apply)
      + pg_stat_statements_track            = (known after apply)
      + shared_buffers_percentage           = (known after apply)
      + temp_file_limit                     = (known after apply)
      + timezone                            = "UTC"
      + track_activity_query_size           = (known after apply)
      + track_commit_timestamp              = (known after apply)
      + track_functions                     = (known after apply)
      + track_io_timing                     = (known after apply)
      + wal_sender_timeout                  = (known after apply)
      + wal_writer_delay                    = (known after apply)
      + work_mem                            = (known after apply)

      + pgbouncer (known after apply)

      + timescaledb (known after apply)
    }

  # module.gateway_pg_configure.digitalocean_database_user.flyway_user will be created
  + resource "digitalocean_database_user" "flyway_user" {
      + access_cert = (sensitive value)
      + access_key  = (sensitive value)
      + cluster_id  = (known after apply)
      + id          = (known after apply)
      + name        = "flyway_user"
      + password    = (sensitive value)
      + role        = (known after apply)
    }

  # module.gateway_pg_configure.postgresql_grant.flyway_schema_usage will be created
  + resource "postgresql_grant" "flyway_schema_usage" {
      + database          = "gateway_db"
      + id                = (known after apply)
      + object_type       = "schema"
      + privileges        = [
          + "CREATE",
          + "USAGE",
        ]
      + role              = "flyway_group"
      + schema            = "public"
      + with_grant_option = false
    }

  # module.gateway_pg_configure.postgresql_grant_role.flyway_assignment will be created
  + resource "postgresql_grant_role" "flyway_assignment" {
      + grant_role        = "flyway_group"
      + id                = (known after apply)
      + role              = "flyway_user"
      + with_admin_option = false
    }

  # module.gateway_pg_configure.postgresql_role.flyway_group will be created
  + resource "postgresql_role" "flyway_group" {
      + bypass_row_level_security = false
      + connection_limit          = -1
      + create_database           = false
      + create_role               = false
      + encrypted_password        = true
      + id                        = (known after apply)
      + inherit                   = true
      + login                     = false
      + name                      = "flyway_group"
      + replication               = false
      + skip_drop_role            = false
      + skip_reassign_owned       = false
      + superuser                 = false
      + valid_until               = "infinity"
    }

Plan: 8 to add, 0 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>